Revit 2024 API
Categories.ForwardIterator Method
Retrieves a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override CategoryNameMapIterator ForwardIterator()
Visual Basic
Public Overrides Function ForwardIterator As CategoryNameMapIterator
Visual C++
public:
virtual CategoryNameMapIterator^ ForwardIterator() override
Return Value
A forward moving iterator to the map.
See Also
Categories Class
Autodesk.Revit.DB Namespace